cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "exercism"
brew "fzf"
brew "fd"
brew "tmux"
brew "docker-compose"
brew "hh"
brew "wget"
brew "kubectl"
brew "shellcheck"
brew "ccat"
brew "tree"
brew "golang"
# brew "nvm" -- NOT SUPPORTED
brew "tig"
brew "vim"
brew "git-open"
brew "github/gh/gh"

# Casks
cask "docker"
cask "virtualbox"
cask "visual-studio-code"
cask "postman"
cask "haskell-platform"

# fonts
cask "font-hack-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hasklig-nerd-font"

# misc
# mas "Xcode", id: 497799835
# cask "alfred"
# cask "evernote"
# cask "google-chrome"
# cask "dropbox"
# cask "notion"
# cask "iterm2"
# cask "slack"
# cask "sourcetree"
# cask "amazon-music"
# cask "skitch"
# cask "mongodb-compass"

# App store
# mas "Magnet", id: 441258766

# Getting a list of globally installed npm packages
# npm install -g chokidar git-open live-server
# npm list -g --depth 0
