cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "vim"
brew "fzf"
brew "fd"
brew "tmux"
brew "hh"
brew "wget"
brew "kubectl"
brew "shellcheck"
brew "ccat"
brew "tree"
brew "tig"
brew "htop"

brew "coreutils" # asdf
brew "gpg"       # asdf
brew "git-open"
brew "gh"

# Casks
cask "google-chrome"
cask "docker"
cask "iterm2"
cask "visual-studio-code"
cask "gitkraken"
cask "postman"
cask "alt-tab"
cask "alfred"
cask "dropbox"
mas "Xcode", id: 497799835

# App Store
# mas "Magnet", id: 441258766

# Fonts
# cask "font-hack-nerd-font"


# Getting a list of globally installed npm packages
# npm install -g chokidar git-open live-server
# npm list -g --depth 0
