cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "caskroom/fonts"

brew "exercism"
brew "tmux"
brew "docker-compose"
brew "hh"
brew "wget"
brew "kubectl"
brew "shellcheck"
brew "ccat"
brew "tree"
brew "golang"
brew "tig"
brew "vim"
brew "git-open"

# Casks
cask "font-hack-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hasklig-nerd-font"
cask "docker"
cask "virtualbox"
cask "minikube"
cask "postman"
cask "alfred"
cask "evernote"
cask "google-chrome"
cask "dropbox"
cask "visual-studio-code"
cask "notion"
cask "iterm2"
cask "slack"
cask "haskell-platform"
cask "sourcetree"
cask "amazon-music"
cask "skitch"
cask "mongodb-compass"
cask "mandrake" # for man pages

# App store
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835

# Getting a list of globally installed npm packages
# npm install -g chokidar git-open live-server
# npm list -g --depth 0
